info/resources.md

# Table of Contents

1.  [Ansys and APDL resources](#orgecb7f20)
2.  [Emacs editor resources](#orge99f098)
3.  [Other APDL editor resources](#org282952b)


<a id="orgecb7f20"></a>

# Ansys and APDL resources

-   The online Ansys [reference manuals](https://ansyshelp.ansys.com/) (registration required) and
    the Ansys [video playlist](https://www.youtube.com/user/ansysinc/playlists) on YouTube
-   The [Ansys homepage](http://www.ansys.com)
-   The Ansys [Learning Hub](https://www.ansys.com/services/ansys-learning-hub)
-   The Ansys [Customer Portal](https://support.ansys.com/Home/HomePage)
-   Xansys, an [Ansys online community](http://www.xansys.org) (forum registration is necessary)
-   The [PADT Focus](http://www.padtinc.com/blog/the-focus/) site, a blog of an engineering company in North
    America
-   A general Ansys repository [Ansys.net](http://www.ansys.net), last update from 2016
    (state 2021-10-16)
-   [AUC](http://www.auc-ev.de/), the Ansys User Club eV. in Germany


<a id="orge99f098"></a>

# Emacs editor resources

-   The [guided Tour](https://www.gnu.org/software/emacs/tour/index.html) of GNU-Emacs
-   Emacs' [Stackexchange](http://emacs.stackexchange.com), the question and answer site for Emacs
-   [EmacsWiki](http://www.emacswiki.org), an encyclopedia for everything related to Emacs
-   The [Emacs help](mailto:help-gnu-emacs@gnu.org) mailing list


<a id="org282952b"></a>

# Other APDL editor resources

-   Since Ansys 2020R1 the Command (APDL) worksheet acquired -
    finally - syntax highlighting and command completion
-   The Ansys [APDL plug-in](https://catalog.ansys.com/product/5b3bc6857a2f9a5c90d32ddb/apdl-editor) from the Ansys store, published in 2017
    (and not maintained since then?)
-   Simple APDL syntax highlighting extensions are available for
    various editors, gvim, nedit, &#x2026; to name a few, please have a
    look at [Ansys.net](https://ansys.net)
-   A commercial competitor of apdl-mode: The [Pedal](http://www.padtinc.com/pedal) script editor for
    Windows, project disbanded in 2015
-   A free Windows [APDL editor](http://apdl.de), site not maintained since 2011

